PitchStarter/app/controllers/pitches_controller.rb

  def create
    @pitch = Pitch.new(pitch_params)
    if @pitch.save
---
INSERT INTO "pitches" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-21 22:31:13.552113"], ["title", "alias"], ["updated_at", "2014-11-21 22:31:13.552113"], ["url", "http://wisozk.net/jazmin_koelpin"]]

  def update
    @pitch = Pitch.find(params[:id])
    @pitch.update(pitch_params)
---
SELECT  "pitches".* FROM "pitches"  WHERE "pitches"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "pitches" SET "title" = $1, "updated_at" = $2, "url" = $3 WHERE "pitches"."id" = 5  [["title", "eos"], ["updated_at", "2014-11-21 22:31:13.562932"], ["url", "http://gutmann.name/jammie"]]