PitchStarter/app/controllers/pitches_controller.rb

SELECT  "pitches".* FROM "pitches"   ORDER BY "pitches"."created_at" DESC LIMIT 1
---
  def index
    @pitches = Pitch.all